GloryIntermedia/custom_addons/gas_station_cash/_check_SOAP.xml

<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/"><soap-env:Body><ns0:InventoryRequest xmlns:ns0="http://www.glory.co.jp/bruebox.xsd"><ns0:Id></ns0:Id><ns0:SeqNo></ns0:SeqNo><ns0:SessionID>1</ns0:SessionID><Option ns0:type="0"/></ns0:InventoryRequest></soap-env:Body></soap-env:Envelope>
/home/tungmay/Projects/Freelance/GloryMiddleware/GloryAPI/venv/lib/python3.12/site-packages/urllib3/connectionpool.py:1097: InsecureRequestWarning: Unverified HTTPS request is being made to host '192.168.0.25'. Adding certificate verification is strongly advised. See: https://urllib3.readthedocs.io/en/latest/advanced-usage.html#tls-warnings
  warnings.warn(
2026-03-30 21:45:38,056 - zeep.transports - DEBUG - HTTP Response from https://192.168.0.25:443/axis2/services/BrueBoxService (status: 200):
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Body><n:InventoryResponse xmlns:n="http://www.glory.co.jp/bruebox.xsd" n:result="0"><n:Id></n:Id><n:SeqNo></n:SeqNo><n:User></n:User><Cash n:type="3"><Denomination n:cc="EUR" n:fv="500" n:rev="0" n:devid="1"><n:Piece>10</n:Piece><n:Status>2</n:Status></Denomination><Denomination n:cc="EUR" n:fv="1000" n:rev="0" n:devid="1"><n:Piece>39</n:Piece><n:Status>2</n:Status></Denomination><Denomination n:cc="EUR" n:fv="2000" n:rev="0" n:devid="1"><n:Piece>54</n:Piece><n:Status>2</n:Status></Denomination><Denomination n:cc="EUR" n:fv="5000" n:rev="0" n:devid="1"><n:Piece>43</n:Piece><n:Status>2</n:Status></Denomination><Denomination n:cc="EUR" n:fv="10000" n:rev="0" n:devid="1"><n:Piece>16</n:Piece><n:Status>2</n:Status></Denomination><Denomination n:cc="EUR" n:fv="20000" n:rev="0" n:devid="1"><n:Piece>16</n:Piece><n:Status>2</n:Status></Denomination><Denomination n:cc="EUR" n:fv="50000" n:rev="0" n:devid="1"><n:Piece>13</n:Piece><n:Status>2</n:Status></Denomination><Denomination n:cc="EUR" n:fv="100" n:rev="0" n:devid="2"><n:Piece>20</n:Piece><n:Status>2</n:Status></Denomination><Denomination n:cc="EUR" n:fv="2" n:rev="0" n:devid="2"><n:Piece>10</n:Piece><n:Status>2</n:Status></Denomination><Denomination n:cc="EUR" n:fv="200" n:rev="0" n:devid="2"><n:Piece>10</n:Piece><n:Status>2</n:Status></Denomination><Denomination n:cc="EUR" n:fv="20" n:rev="0" n:devid="2"><n:Piece>20</n:Piece><n:Status>2</n:Status></Denomination><Denomination n:cc="EUR" n:fv="5" n:rev="0" n:devid="2"><n:Piece>20</n:Piece><n:Status>2</n:Status></Denomination><Denomination n:cc="EUR" n:fv="50" n:rev="0" n:devid="2"><n:Piece>20</n:Piece><n:Status>2</n:Status></Denomination><Denomination n:cc="EUR" n:fv="1" n:rev="0" n:devid="2"><n:Piece>10</n:Piece><n:Status>2</n:Status></Denomination><Denomination n:cc="EUR" n:fv="10" n:rev="0" n:devid="2"><n:Piece>20</n:Piece><n:Status>2</n:Status></Denomination></Cash><Cash n:type="4"><Denomination n:cc="EUR" n:fv="500" n:rev="0" n:devid="1"><n:Piece>0</n:Piece><n:Status>0</n:Status></Denomination><Denomination n:cc="EUR" n:fv="1000" n:rev="0" n:devid="1"><n:Piece>0</n:Piece><n:Status>0</n:Status></Denomination><Denomination n:cc="EUR" n:fv="2000" n:rev="0" n:devid="1"><n:Piece>22</n:Piece><n:Status>2</n:Status></Denomination><Denomination n:cc="EUR" n:fv="5000" n:rev="0" n:devid="1"><n:Piece>6</n:Piece><n:Status>1</n:Status></Denomination><Denomination n:cc="EUR" n:fv="100" n:rev="0" n:devid="2"><n:Piece>0</n:Piece><n:Status>0</n:Status></Denomination><Denomination n:cc="EUR" n:fv="2" n:rev="0" n:devid="2"><n:Piece>0</n:Piece><n:Status>0</n:Status></Denomination><Denomination n:cc="EUR" n:fv="200" n:rev="0" n:devid="2"><n:Piece>0</n:Piece><n:Status>0</n:Status></Denomination><Denomination n:cc="EUR" n:fv="20" n:rev="0" n:devid="2"><n:Piece>0</n:Piece><n:Status>0</n:Status></Denomination><Denomination n:cc="EUR" n:fv="5" n:rev="0" n:devid="2"><n:Piece>0</n:Piece><n:Status>0</n:Status></Denomination><Denomination n:cc="EUR" n:fv="50" n:rev="0" n:devid="2"><n:Piece>0</n:Piece><n:Status>0</n:Status></Denomination><Denomination n:cc="EUR" n:fv="1" n:rev="0" n:devid="2"><n:Piece>0</n:Piece><n:Status>0</n:Status></Denomination><Denomination n:cc="EUR" n:fv="10" n:rev="0" n:devid="2"><n:Piece>0</n:Piece><n:Status>0</n:Status></Denomination></Cash><CashUnits n:devid="1"><CashUnit n:unitno="4043" n:st="0" n:nf="117" n:ne="13" n:max="130"><Denomination n:cc="EUR" n:fv="500" n:rev="0" n:devid="1"><n:Piece>0</n:Piece><n:Status>0</n:Status></Denomination></CashUnit><CashUnit n:unitno="4044" n:st="0" n:nf="113" n:ne="12" n:max="126"><Denomination n:cc="EUR" n:fv="1000" n:rev="0" n:devid="1"><n:Piece>0</n:Piece><n:Status>0</n:Status></Denomination></CashUnit><CashUnit n:unitno="4045" n:st="2" n:nf="109" n:ne="12" n:max="122"><Denomination n:cc="EUR" n:fv="2000" n:rev="0" n:devid="1"><n:Piece>22</n:Piece><n:Status>2</n:Status></Denomination></CashUnit><CashUnit n:unitno="4046" n:st="1" n:nf="106" n:ne="11" n:max="118"><Denomination n:cc="EUR" n:fv="5000" n:rev="0" n:devid="1"><n:Piece>6</n:Piece><n:Status>1</n:Status></Denomination></CashUnit><CashUnit n:unitno="4056" n:st="2" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4057" n:st="2" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4058" n:st="2" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4059" n:st="2" n:nf="720" n:ne="0" n:max="800"><Denomination n:cc="EUR" n:fv="500" n:rev="0" n:devid="1"><n:Piece>10</n:Piece><n:Status>2</n:Status></Denomination><Denomination n:cc="EUR" n:fv="1000" n:rev="0" n:devid="1"><n:Piece>39</n:Piece><n:Status>2</n:Status></Denomination><Denomination n:cc="EUR" n:fv="2000" n:rev="0" n:devid="1"><n:Piece>32</n:Piece><n:Status>2</n:Status></Denomination><Denomination n:cc="EUR" n:fv="5000" n:rev="0" n:devid="1"><n:Piece>37</n:Piece><n:Status>2</n:Status></Denomination><Denomination n:cc="EUR" n:fv="10000" n:rev="0" n:devid="1"><n:Piece>16</n:Piece><n:Status>2</n:Status></Denomination><Denomination n:cc="EUR" n:fv="20000" n:rev="0" n:devid="1"><n:Piece>16</n:Piece><n:Status>2</n:Status></Denomination><Denomination n:cc="EUR" n:fv="50000" n:rev="0" n:devid="1"><n:Piece>13</n:Piece><n:Status>2</n:Status></Denomination></CashUnit><CashUnit n:unitno="4060" n:st="2" n:nf="720" n:ne="0" n:max="800"><Denomination n:cc="EUR" n:fv="500" n:rev="0" n:devid="1"><n:Piece>0</n:Piece><n:Status>2</n:Status></Denomination><Denomination n:cc="EUR" n:fv="1000" n:rev="0" n:devid="1"><n:Piece>0</n:Piece><n:Status>2</n:Status></Denomination><Denomination n:cc="EUR" n:fv="2000" n:rev="0" n:devid="1"><n:Piece>0</n:Piece><n:Status>2</n:Status></Denomination><Denomination n:cc="EUR" n:fv="5000" n:rev="0" n:devid="1"><n:Piece>0</n:Piece><n:Status>2</n:Status></Denomination><Denomination n:cc="EUR" n:fv="10000" n:rev="0" n:devid="1"><n:Piece>0</n:Piece><n:Status>2</n:Status></Denomination><Denomination n:cc="EUR" n:fv="20000" n:rev="0" n:devid="1"><n:Piece>0</n:Piece><n:Status>2</n:Status></Denomination><Denomination n:cc="EUR" n:fv="50000" n:rev="0" n:devid="1"><n:Piece>0</n:Piece><n:Status>2</n:Status></Denomination></CashUnit><CashUnit n:unitno="4092" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4093" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4094" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4095" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4061" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4062" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4063" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4064" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4074" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4075" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4076" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4077" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4136" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4137" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4138" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4139" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4140" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4118" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4119" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4120" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4121" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4124" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4125" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4126" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4127" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit></CashUnits><CashUnits n:devid="2"><CashUnit n:unitno="4043" n:st="0" n:nf="45" n:ne="5" n:max="50"><Denomination n:cc="EUR" n:fv="100" n:rev="0" n:devid="2"><n:Piece>0</n:Piece><n:Status>0</n:Status></Denomination></CashUnit><CashUnit n:unitno="4044" n:st="0" n:nf="63" n:ne="7" n:max="70"><Denomination n:cc="EUR" n:fv="2" n:rev="0" n:devid="2"><n:Piece>0</n:Piece><n:Status>0</n:Status></Denomination></CashUnit><CashUnit n:unitno="4045" n:st="0" n:nf="81" n:ne="9" n:max="90"><Denomination n:cc="EUR" n:fv="200" n:rev="0" n:devid="2"><n:Piece>0</n:Piece><n:Status>0</n:Status></Denomination></CashUnit><CashUnit n:unitno="4046" n:st="0" n:nf="216" n:ne="24" n:max="240"><Denomination n:cc="EUR" n:fv="20" n:rev="0" n:devid="2"><n:Piece>0</n:Piece><n:Status>0</n:Status></Denomination></CashUnit><CashUnit n:unitno="4047" n:st="0" n:nf="81" n:ne="9" n:max="90"><Denomination n:cc="EUR" n:fv="5" n:rev="0" n:devid="2"><n:Piece>0</n:Piece><n:Status>0</n:Status></Denomination></CashUnit><CashUnit n:unitno="4048" n:st="0" n:nf="135" n:ne="15" n:max="150"><Denomination n:cc="EUR" n:fv="50" n:rev="0" n:devid="2"><n:Piece>0</n:Piece><n:Status>0</n:Status></Denomination></CashUnit><CashUnit n:unitno="4054" n:st="0" n:nf="126" n:ne="14" n:max="140"><Denomination n:cc="EUR" n:fv="1" n:rev="0" n:devid="2"><n:Piece>0</n:Piece><n:Status>0</n:Status></Denomination></CashUnit><CashUnit n:unitno="4055" n:st="0" n:nf="126" n:ne="14" n:max="140"><Denomination n:cc="EUR" n:fv="10" n:rev="0" n:devid="2"><n:Piece>0</n:Piece><n:Status>0</n:Status></Denomination></CashUnit><CashUnit n:unitno="4056" n:st="2" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4057" n:st="2" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4058" n:st="2" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4059" n:st="2" n:nf="900" n:ne="0" n:max="1000"><Denomination n:cc="EUR" n:fv="1" n:rev="0" n:devid="2"><n:Piece>10</n:Piece><n:Status>2</n:Status></Denomination><Denomination n:cc="EUR" n:fv="2" n:rev="0" n:devid="2"><n:Piece>10</n:Piece><n:Status>2</n:Status></Denomination><Denomination n:cc="EUR" n:fv="5" n:rev="0" n:devid="2"><n:Piece>20</n:Piece><n:Status>2</n:Status></Denomination><Denomination n:cc="EUR" n:fv="10" n:rev="0" n:devid="2"><n:Piece>20</n:Piece><n:Status>2</n:Status></Denomination><Denomination n:cc="EUR" n:fv="20" n:rev="0" n:devid="2"><n:Piece>20</n:Piece><n:Status>2</n:Status></Denomination><Denomination n:cc="EUR" n:fv="50" n:rev="0" n:devid="2"><n:Piece>20</n:Piece><n:Status>2</n:Status></Denomination><Denomination n:cc="EUR" n:fv="100" n:rev="0" n:devid="2"><n:Piece>20</n:Piece><n:Status>2</n:Status></Denomination><Denomination n:cc="EUR" n:fv="200" n:rev="0" n:devid="2"><n:Piece>10</n:Piece><n:Status>2</n:Status></Denomination></CashUnit><CashUnit n:unitno="4060" n:st="2" n:nf="900" n:ne="0" n:max="1000"><Denomination n:cc="EUR" n:fv="1" n:rev="0" n:devid="2"><n:Piece>0</n:Piece><n:Status>2</n:Status></Denomination><Denomination n:cc="EUR" n:fv="2" n:rev="0" n:devid="2"><n:Piece>0</n:Piece><n:Status>2</n:Status></Denomination><Denomination n:cc="EUR" n:fv="5" n:rev="0" n:devid="2"><n:Piece>0</n:Piece><n:Status>2</n:Status></Denomination><Denomination n:cc="EUR" n:fv="10" n:rev="0" n:devid="2"><n:Piece>0</n:Piece><n:Status>2</n:Status></Denomination><Denomination n:cc="EUR" n:fv="20" n:rev="0" n:devid="2"><n:Piece>0</n:Piece><n:Status>2</n:Status></Denomination><Denomination n:cc="EUR" n:fv="50" n:rev="0" n:devid="2"><n:Piece>0</n:Piece><n:Status>2</n:Status></Denomination><Denomination n:cc="EUR" n:fv="100" n:rev="0" n:devid="2"><n:Piece>0</n:Piece><n:Status>2</n:Status></Denomination><Denomination n:cc="EUR" n:fv="200" n:rev="0" n:devid="2"><n:Piece>0</n:Piece><n:Status>2</n:Status></Denomination></CashUnit><CashUnit n:unitno="4074" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4075" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4076" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4077" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4078" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4079" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4080" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4081" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4118" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4119" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4120" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4121" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4122" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4123" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4134" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4135" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4136" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4137" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4138" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4139" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit><CashUnit n:unitno="4140" n:st="22" n:nf="0" n:ne="0" n:max="0"></CashUnit></CashUnits></n:InventoryResponse></soapenv:Body></soapenv:Envelope>